---
title: DuctLiningType
classe: Autodesk.Revit.DB.Mechanical.DuctLiningType
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# DuctLiningType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Roughness { get; set; }` | `ductLiningType.Roughness` | Double |
| `Boolean IsValidRoughness(Double)` | `ductLiningType.IsValidRoughness(roughness)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```